# Задание 8. Бегущая строка
# Что нужно сделать
# В одной из практических работ вы писали программу для табло, которая циклически сдвигает элементы списка чисел вправо
# на K позиций. В этот раз вы работаете с двумя строками. Возможно, одна из строк немного сдвинута.
# Нужно проверить, не равна ли первая строка второй.
#
# Пользователь вводит две строки. Напишите программу, которая определяет,
# можно ли получить первую строку из второй циклическим сдвигом.
#
# По желанию: если строку получить можно, выведите значение сдвига.
#
# Пример 1
#
# Первая строка: abcd.
#
# Вторая строка: cdab.
#
# Первая строка получается из второй со сдвигом 2.
#
# Пример 2
#
# Первая строка: abcd.
#
# Вторая строка: cdba.
#
# Первую строку нельзя получить из второй с помощью циклического сдвига.
#
# Что оценивается
#
# Результат вычислений корректен.
# Input содержит корректные приглашения для ввода.
# Формат вывода соответствует примеру.
# Переменные и функции имеют значимые имена, не только a, b, c, d.

first, second = input("Первая строка: "), input("Вторая строка: ")
check = False
for i in range(len(first)):
    test = second[i:] + second[:i]
    if test == first:
        check = True
        move = i
        break

if check:
    print(f"Первая строка получается из второй со сдвигом {move}.")
else:
    print("Первую строку нельзя получить из второй с помощью циклического сдвига.")