# Задание 6. Двумерный список
# Что нужно сделать
# Часто в программировании приходится писать код исходя из результата, который требует заказчик.
# В этот раз ему нужно получить двумерный список:
#
# [[1, 5, 9], [2, 6, 10], [3, 7, 11], [4, 8, 12]]
#
# Напишите программу, которая генерирует такой список и выводит его на экран. Используйте только list comprehensions.
#
# Что оценивается
# Результат вычислений корректен.
# Формат вывода соответствует примеру: двумерный список с числами без текста.
# Переменные и функции имеют значимые имена, не только a, b, c, d.

# def start
def tmp(num):
    temp = [num + j * 4 for j in range(3)]
    return temp
# def end

ls = [tmp(i) for i in range(1,5)]

print(ls)
