Задача 7. Ход конём
Что нужно сделать

В рамках разработки шахматного ИИ стоит новая задача. По заданным вещественным координатам коня и второй точки программа должна определить может ли конь ходить в эту точку. Используйте как можно меньше конструкций if и логических операторов. Обеспечьте контроль ввода.

 

Пример:

Введите местоположение коня:

0.071

0.118

Введите местоположение точки на доске:

0.213

0.068

Конь в клетке (0, 1). Точка в клетке (2, 0).

Да, конь может ходить в эту точку.

Что оценивается

результат вывода соответствует условию;
формат вывода соответствует примеру;
input содержит корректное приглашение для ввода;
вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).