Задача 6. Метеостанция
Что нужно сделать

Сотрудники международной метеостанции должны каждый день передавать показания градусов по шкалам и Цельсия, и Фаренгейта. Напишите программу, которая принимает на вход три целых числа в градусах Цельсия: нижняя граница температуры, верхняя граница температуры и шаг. Программа выводит на экран таблицу соответствия градусов Цельсия градусам Фаренгейта от нижней до верхней границы с указанным шагом. Обеспечьте контроль ввода. Верхняя граница должна печататься, даже если последний шаг “перепрыгнул “ ее. Известно, что 0С соответствует 32F, а каждый градус Цельсия эквивалентен 1.8 градусам Фаренгейта.

 

Пример:

Ввод:

Нижняя граница: 0

Верхняя граница: 50

Шаг: 20

Вывод:

C   F

0   32

20  68

40  104

50  122



Что оценивается

результат вывода соответствует условию;
формат вывода соответствует примеру;
input содержит корректное приглашение для ввода;
вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием).