# Задача 7. Стипендия

# Что нужно сделать
# Ежемесячная стипендия студента составляет educational_grant рублей, а расходы на проживание превышают стипендию и
# составляют expenses рублей в месяц. Рост цен ежемесячно увеличивает расходы на 3%, кроме первого месяца.
# Составьте программу расчёта суммы денег, которую необходимо получить у родителей один раз в начале обучения,
# чтобы можно было прожить учебный год (десять месяцев), используя только эти деньги и стипендию.

# Пример:
# Введите стипендию: 10000
# Введите расходы на проживание: 13000

# У родителей необходимо попросить 49030.431

# Что оценивается
# Задание считается успешно выполненным, если:
# результат вывода соответствует условию;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием);
# input содержит корректное приглашение для ввода;
# переменные имеют значащие имена, не только a, b, c, d.
