# Задача 9. Выражение
# Что нужно сделать
# Дано число x. Напишите программу для вычисления следующего выражения:

# Советы и рекомендации
# Обратите внимание на последовательность в числителе и знаменателе. Эта последовательность не является возрастающей
# арифметической последовательностью 1, 3, 5, 7 … 63 и 2, 4, 6, 8 … 64.

# Что оценивается
# Задание считается успешно выполненным, если:
# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода;
# переменные имеют значащие имена, не только a, b, c, d.
# Допускается вывод без описания, достаточно вывести сумму ряда.