# Задача 6. Спецшифр

# Что нужно сделать
# Два сотрудника спецслужб переписываются необычным шифром. Каждую букву они шифруют в виде строки,
# внутри которой есть длинная последовательность букв “s”, а длина самой длинной - это и есть номер буквы алфавита, которую хотят отправить.
# Напишите программу, которая получает на вход строку, подсчитывает в ней самую длинную
# последовательность подряд идущих букв “s” и выводит ответ на экран.

# Пример:
# Введите строку: ssbbbsssbc
# Самая длинная последовательность: 3

# Что оценивается
# Задание считается успешно выполненным, если:

# результат вывода соответствует условию;
# input содержит корректное приглашение для ввода;
# вывод содержит описание результата (выведенные числа сопровождаются текстовым описанием);
# Переменные имеют значащие имена, не только a, b, c, d (видео 2.3)